Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: 2. The de-aerator of claim 1, wherein the at least one sidewall (58) has an interior sidewall surface (58I) and the at least one partition (54) has a circumferential edge (92) contiguous with the interior sidewall surface (58I).
de_de: 2. Entlüfter nach Anspruch 1, wobei die mindestens eine Seitenwand (58) eine innenliegende Fläche (58I) der Seitenwand aufweist und die mindestens eine Trennwand (54) eine Umfangskante (92) aufweist, die an die innenliegende Fläche (58I) der Seitenwand angrenzt.

source: 3. The de-aerator of claim 2, wherein the apertures (94) of the plurality of apertures (94) are arranged in patterns concentric with the center axis (64).
de_de: 3. Entlüfter nach Anspruch 2, wobei die Aussparungen (94) der Vielzahl von Aussparungen (94) in Mustern arrangiert sind, die konzentrisch zu der Mittelachse (64) sind.

source: 4. The de-aerator of any preceding claim, wherein the at least one partition (54) includes a first partition (54) and a second partition (54) axially spaced apart from one another.
de_de: 4. Entlüfter nach einem der vorhergehenden Ansprüche, wobei die mindestens eine Trennwand (54) eine erste Trennwand (54) und eine zweite Trennwand (54) beinhaltet, die axial voneinander beabstandet sind.

source: 5. The de-aerator of any preceding claim, further comprising a centrally located vent tube (52) extending substantially parallel to the central axis (64) of the de-aerator; and
de_de: 5. Entlüfter nach einem der vorhergehenden Ansprüche, ferner ein zentral positioniertes Lüftungsrohr (52) umfassend, das sich im Wesentlichen parallel zu der Mittelachse (64) des Entlüfters erstreckt; und

source: wherein the helical fluid passage (46) includes a helically extending panel (78) that extends between an interior surface (58I) of the at least one sidewall (58) and an exterior surface (52E) of the vent tube (52);
de_de: wobei der schraubenförmige Fluiddurchgang (46) eine sich schraubenförmig erstreckende Platte (78) beinhaltet, die sich zwischen einer innenliegenden Fläche (58I) der mindestens einen Seitenwand (58) und einer äußeren Fläche (52E) des Lüftungsrohrs (52) erstreckt;

source: wherein an outer radial surface of the helical fluid passage is defined by the sidewall interior surface (58I), and an inner radial surface of the helical fluid passage (46) is defined by the exterior surface (52E) of the vent tube (52).
de_de: wobei eine äußere radiale Oberfläche des schraubenförmigen Fluiddurchgangs durch die innenliegende Fläche (58I) der Seitenwand definiert ist und eine innere radiale Oberfläche des schraubenförmigen Fluiddurchgangs (46) durch die Außenfläche (52E) des Lüftungsrohrs (52) definiert ist.

source: 6. The de-aerator of claim 5, wherein the de-aerator further comprises a plurality of vent apertures (80) aligned with the helical fluid passage (46) and extending through the vent tube wall.
de_de: 6. Entlüfter nach Anspruch 5, wobei der Entlüfter ferner eine Vielzahl von Entlüftungsaussparungen (80) umfasst, die an dem schraubenförmigen Fluiddurchgang (46) ausgerichtet sind und sich durch die Wand des Lüftungsrohrs erstrecken.

source: 7. The de-aerator of any preceding claim, wherein the helical fluid passage (46) includes at least one helically extending panel (78) that extends radially inwardly from an or the interior surface (58I) of the at least one sidewall (58) to an inner radial edge, and an inner radial wall (86) joined to the inner radial edge of the helically extending panel (78).
de_de: 7. Entlüfter nach einem der vorhergehenden Ansprüche, wobei der schraubenförmige Fluiddurchgang (46) mindestens eine sich schraubenförmig erstreckende Platte (78), die sich von einer oder der innenliegenden Fläche (58I) der mindestens einen Seitenwand (58) radial nach innen zu einer inneren radialen Kante erstreckt, und eine innere radiale Wand (86), die mit der inneren radialen Kante der sich schraubenförmig erstreckenden Platte (78) gekoppelt ist, beinhaltet.

source: 8. The de-aerator of claim 7, wherein the helical fluid passage (46) is an enclosed passage.
de_de: 8. Entlüfter nach Anspruch 7, wobei der schraubenförmige Fluiddurchgang (46) ein geschlossener Durchgang ist.

source: 9. The de-aerator of claim 8, further comprising a plurality of vent apertures (80) disposed in the inner radial wall (86).
de_de: 9. Entlüfter nach Anspruch 8, ferner eine Vielzahl von Entlüftungsaussparungen (80) umfassend, die in der inneren radialen Wand (86) angeordnet sind.

source: The de-aerator of any of claims 7 to 9, wherein the inner radial wall (86) extends axially a distance and defines a passage above the inner radial wall configured to permit passage of air out of the helical fluid passage (46) and into a central region (84) of the de-aerator.
de_de: Entlüfter nach einem der Ansprüche 7 bis 9, wobei sich die innere radiale Wand (86) axial über eine Distanz erstreckt und einen Durchgang oberhalb der inneren radialen Wand definiert, der konfiguriert ist, um den Durchgang von Luft aus dem schraubenförmigen Fluiddurchgang (46) heraus und in einen zentralen Bereich (84) des Entlüfters hinein ermöglicht.

source: The de-aerator of any of claims 7 to 10, wherein the at least one helically extending panel (78) includes a first helically extending panel and a second helically extending panel, each extending radially inwardly from the sidewall interior surface (58I), and the inner radial wall (58) extends between the first helically extending panel and the second helically extending panel to form an enclosed helical fluid passage (46).
de_de: Entlüfter nach einem der Ansprüche 7 bis 10, wobei die mindestens eine sich schraubenförmig erstreckende Platte (78) eine erste sich schraubenförmig erstreckende Platte und eine zweite sich schraubenförmig erstreckende Platte beinhaltet, die sich jeweils von der innenliegenden Fläche (58I) der Seitenwand radial nach innen erstrecken, und die innere radiale Wand (58) sich zwischen der ersten sich schraubenförmig erstreckenden Platte und der zweiten sich schraubenförmig erstreckenden Platte erstreckt, um einen geschlossenen schraubenförmigen Fluiddurchgang (46) zu bilden.

source: The de-aerator of any preceding claim, wherein the at least one fluid outlet (48) is disposed in the base panel (60).
de_de: Entlüfter nach einem der vorhergehenden Ansprüche, wobei der mindestens eine Flüssigkeitsauslass (48) in der Basisplatte (60) angeordnet ist.

source: The de-aerator of any of claims 1 to 11, wherein the at least one fluid outlet (48) includes a plurality of fluid outlets (48) disposed in the at least one side wall (58), optionally:
de_de: Entlüfter nach einem der Ansprüche 1 bis 11, wobei der mindestens eine Fluidauslass (48) eine Vielzahl von Fluidauslässen (48) beinhaltet, die in der mindestens einen Seitenwand (58) angeordnet sind, optional:

source: wherein the de-aerator further comprises a fluid collection body (50) disposed radially outside of the at least one sidewall (58), wherein the fluid collection body (50) is substantially concentric with and radially spaced apart from, an exterior surface (58E) of the at least one sidewall (58) to form an annular cavity therebetween.
de_de: wobei der Entlüfter ferner einen Fluidsammelkörper (50) umfasst, der radial außerhalb der mindestens einen Seitenwand (58) angeordnet ist, wobei der Fluidsammelkörper (50) im Wesentlichen konzentrisch und radial beabstandet zu einer äußeren Fläche (58E) der mindestens einen Seitenwand (58) ist, um dazwischen einen ringförmigen Hohlraum zu bilden.

source: The de-aerator of any preceding claim, wherein the at least one sidewall (58), the base panel (60), the fluid inlet (42), the helical fluid passage (46), and the at least one partition (54) are a unitary structure formed using an additive manufacturing technique, optionally, wherein the cover panel (56) is part of the unitary structure.
de_de: Entlüfter nach einem der vorhergehenden Ansprüche, wobei die mindestens eine Seitenwand (58), die Basisplatte (60), der Fluideinlass (42), der schraubenförmige Flüssigkeitsdurchgang (46) und die mindestens eine Trennwand (54) eine einheitliche Struktur sind, die mithilfe einer additiven Fertigungstechnik gebildet ist, wobei die Abdeckplatte (56) optional Teil der einheitlichen Struktur ist.

source: A lubrication system (30) for a gas turbine engine (20), comprising:
de_de: Schmiersystem (30) für ein Gasturbinentriebwerk (20), umfassend:

source: a lubricant tank (34);
de_de: einen Schmiermitteltank (34);

source: a lubricant pump (32);
de_de: eine Schmiermittelpumpe (32);

source: a scavenge pump (38); and
de_de: eine Spülpumpe (38); und

source: a de-aerator (36) as recited in any preceding claim,
de_de: einen Entlüfter (36) nach einem der vorhergehenden Ansprüche,

source: wherein the lubricant tank (34), the lubricant pump (32), the scavenge pump (38), and the de-aerator (36) are in fluid communication with one another and form a lubrication circuit, such that the lubricant pump (32) is configured to pump lubricant from the lubricant tank (34) to one or more engine components, and the scavenge pump (38) is configured to pump lubricant received from the one or more engine components to the de-aerator (36), and lubricant passing through the de-aerator (36) is passed into the lubricant tank (34).
de_de: wobei der Schmiermitteltank (34), die Schmiermittelpumpe (32), die Spülpumpe (38) und der Entlüfter (36) in Fluidkommunikation miteinander sind und derart einen Schmierkreislauf bilden, dass die Schmiermittelpumpe (32) konfiguriert ist, um Schmiermittel aus dem Schmiermitteltank (34) zu ein oder mehreren Motorkomponenten zu pumpen, und die Spülpumpe (38) konfiguriert ist, um Schmiermittel, das sie von der einen oder den mehreren Motorkomponenten erhält, zu dem Entlüfter (36) zu pumpen, und Schmiermittel, das den Entlüfter (36) durchläuft, in den Schmiermitteltank (34) geführt wird.

source: 1. A valve assembly comprising:
de_de: 1. Ventilbaugruppe, umfassend:

source: a first sleeve (102) defining a piston bore (104) therein;
de_de: eine erste Hülse (102), die darin eine Kolbenbohrung (104) definiert;

source: a second sleeve (106) defining a piston bore (108) therein, wherein the piston bore of the first sleeve and the piston bore of the second sleeve are axially aligned;
de_de: eine zweite Hülse (106), die darin eine Kolbenbohrung (108) definiert, wobei die Kolbenbohrung der ersten Hülse und die Kolbenbohrung der zweiten Hülse axial ausgerichtet sind;

source: a piston (110) slidingly engaged in the piston bores of the first and second sleeves; and
de_de: einen Kolben (110), der gleitend in die Kolbenbohrungen der ersten und zweiten Hülse eingreift; und

source: a seal carrier (112) with a plurality of pieces, wherein the seal carrier is axially between the first sleeve and the second sleeve, characterised in that the plurality of pieces of the multi-piece seal carrier are circumferentially spaced apart from one another with circumferential gaps (118) spacing the pieces apart from one another.
de_de: einen Dichtungshalter (112) mit einer Vielzahl von Teilen, wobei der Dichtungshalter axial zwischen der ersten Hülse und der zweiten Hülse ist, dadurch gekennzeichnet, dass die Vielzahl von Teilen des mehrteiligen Dichtungshalters in Umfangsrichtung voneinander beabstandet sind mit Umfangsspalten (118), die die Teile voneinander beabstanden.

source: 2. The assembly as recited in claim 1, wherein the seal carrier (112) extends circumferentially around the piston.
de_de: 2. Baugruppe nach Anspruch 1, wobei sich der Dichtungshalter (112) in Umfangsrichtung um den Kolben erstreckt.

source: 3. The assembly as recited in claim 1 or 2, wherein the seal carrier (112) includes axially extending tabs (120) that seat inside a radially inward surface (122) of at least one of the first sleeve and the second sleeve.
de_de: 3. Baugruppe nach Anspruch 1 oder 2, wobei der Dichtungshalter (112) sich axial erstreckende Laschen (120) beinhaltet, die innerhalb einer radial nach innen gerichteten Oberfläche (122) von mindestens einer der ersten Hülse und der zweiten Hülse sitzen.

source: 4. The assembly as recited in any preceding claim, wherein the piston bore of the first sleeve has a diameter equal to that of the piston bore of the second sleeve.
de_de: 4. Baugruppe nach einem der vorhergehenden Ansprüche, wobei die Kolbenbohrung der ersten Hülse einen Durchmesser aufweist, der dem der Kolbenbohrung der zweiten Hülse entspricht.

source: 5. The assembly as recite in any preceding claim, wherein the piston is spool shaped, with a first piston end (126) engaged with the first sleeve, a second piston end (128) engaged with the second sleeve, and a spool section (130) connecting between the first and second piston ends, wherein the spool section has a smaller diameter that both of the first and second piston ends, and optionally wherein the first piston end, the spool section, and the second piston end are all a single, monolithic piece.
de_de: 5. Baugruppe nach einem der vorhergehenden Ansprüche, wobei der Kolben spulenförmig ist, mit einem ersten Kolbenende (126), das mit der ersten Hülse in Eingriff steht, einem zweiten Kolbenende (128), das mit der zweiten Hülse in Eingriff steht, und einem Spulenabschnitt (130), der das erste und zweite Kolbenende verbindet, wobei der Spulenabschnitt einen kleineren Durchmesser als sowohl das erste als auch das zweite Kolbenende aufweist und optional wobei das erste Kolbenende, der Spulenabschnitt und das zweite Kolbenende alle ein einziges, monolithisches Teil sind.

source: 6. The assembly as recited in any preceding claim, wherein the first sleeve includes a first port (132) radially extending therethrough for fluid communication of a control fluid to act on an outer face of the first piston end.
de_de: 6. Baugruppe nach einem der vorhergehenden Ansprüche, wobei die erste Hülse eine erste Öffnung (132) beinhaltet, die sich radial durch diese hindurch erstreckt, um eine Fluidkommunikation eines Steuerfluids zu ermöglichen, das auf eine äußere Fläche des ersten Kolbenendes einwirkt.

source: 7. The assembly as recited in claim 6, wherein the second sleeve includes a second port (138) radially extending therethrough for fluid communication of a control fluid to act on an outer face of the second piston end.
de_de: 7. Baugruppe nach Anspruch 6, wobei die zweite Hülse eine zweite Öffnung (138) beinhaltet, die sich radial durch diese hindurch erstreckt, um eine Fluidkommunikation eines Steuerfluids zu ermöglichen, das auf eine äußere Fläche des zweiten Kolbenendes einwirkt.

source: 8. The assembly as recited in claim 7, further comprising a face seal seated in the seal carrier, sealing between seal carrier and second sleeve, and optionally wherein each piece of the seal carrier includes a groove (154) with a matching diameter, wherein the face seal (124) is seated in the groove of each piece.
de_de: 8. Baugruppe nach Anspruch 7, ferner umfassend eine in dem Dichtungshalter sitzende Flächendichtung, die zwischen dem Dichtungshalter und der zweiten Hülse abdichtet, und optional wobei jedes Teil des Dichtungshalters eine Nut (154) mit einem passenden Durchmesser beinhaltet, wobei die Flächendichtung (124) in der Nut jedes Teils sitzt.

source: 9. The assembly as recited in claim 8, wherein the first sleeve includes a third port (142) radially extending therethrough for fluid communication of a control fluid into a volume with the spool section between the first and second piston ends.
de_de: 9. Baugruppe nach Anspruch 8, wobei die erste Hülse eine dritte Öffnung (142) beinhaltet, die sich radial durch diese hindurch erstreckt, um eine Fluidkommunikation eines Steuerfluids in ein Volumen mit dem Spulenabschnitt zwischen dem ersten und zweiten Kolbenende zu ermöglichen.

source: The assembly as recited in claim 9, wherein the second sleeve includes a fourth port (146) radially extending therethrough for fluid communication of a control fluid therethrough, wherein in a first position of the piston, the second piston end seals against the face seal preventing flow from the third port to the fourth port, and wherein in a second position of the piston, the second piston end is spaced apart from the face seal to allow fluid communication between the third port and the fourth port, and optionally wherein in the first position of the piston, the face seal seals around a full circumference of the second piston end and of the second sleeve.
de_de: Baugruppe nach Anspruch 9, wobei die zweite Hülse eine vierte Öffnung (146) beinhaltet, die sich radial durch diese hindurch erstreckt, um eine Fluidkommunikation eines Steuerfluids durch diese hindurch zu ermöglichen, wobei in einer ersten Position des Kolbens das zweite Kolbenende gegen die Flächendichtung abdichtet und einen Fluss von der dritten Öffnung zu der vierten Öffnung verhindert und wobei in einer zweiten Position des Kolbens das zweite Kolbenende von der Flächendichtung beabstandet ist, um eine Fluidkommunikation zwischen der dritten Öffnung und der vierten Öffnung zuzulassen, und optional wobei in der ersten Position des Kolbens die Flächendichtung um einen vollständigen Umfang des zweiten Kolbenendes und der zweiten Hülse abdichtet.

source: The assembly as recited in claim 8, further comprising a housing (148) that houses the first and second sleeves therein, and optionally further comprising a radial seal around the second sleeve sealing against the second sleeve and against the housing (148) to stop flow between circumferential gaps between pieces of the seal carrier.
de_de: Baugruppe nach Anspruch 8, ferner umfassend ein Gehäuse (148), das die ersten und zweiten Hülsen darin aufnimmt, und optional ferner umfassend eine radiale Dichtung um die zweite Hülse herum, die gegen die zweite Hülse und gegen das Gehäuse (148) abdichtet, um den Fluss zwischen Umfangsspalten zwischen Teilen des Dichtungshalters zu stoppen.

source: The assembly as recited in any preceding claim, wherein there are two pieces (114, 116) of the seal carrier, wherein two circumferential gaps (118) space apart the two pieces from one another.
de_de: Baugruppe nach einem der vorhergehenden Ansprüche, wobei zwei Teile (114, 116) des Dichtungshalters vorhanden sind, wobei zwei Umfangsspalten (118) die zwei Teile voneinander beabstanden.

source: The assembly as recited in claim 12, further comprising a snap ring (152) engaged about the two pieces to hold the two pieces of the seal carrier together, or further comprising an o-ring (156) engaged about the two pieces to hold the two pieces of the seal carrier together.
de_de: Baugruppe nach Anspruch 12, ferner umfassend einen Sprengring (152), der um die zwei Teile herum in Eingriff steht, um die zwei Teile des Dichtungshalters zusammenzuhalten, oder ferner umfassend einen O-Ring (156), der um die zwei Teile herum in Eingriff steht, um die zwei Teile des Dichtungshalters zusammenzuhalten.

source: The assembly as recited in claim 12 or 13, wherein each piece includes a locating pin (158) seated in a pin bore (160) of the other piece.
de_de: Baugruppe nach Anspruch 12 oder 13, wobei jedes Teil einen Positionierungsstift (158) beinhaltet, der in einer Stiftbohrung (160) des anderen Teils sitzt.

source: The assembly as recited in claim 12, 13 or 14, wherein the two pieces are bolted together across the gaps.
de_de: Baugruppe nach Anspruch 12, 13 oder 14, wobei die zwei Teile über die Spalten hinweg miteinander verschraubt sind.

source: 1. A system (200) for predicting a future pose of a head worn display (104), HWD, wherein
de_de: 1. System (200) zum Vorhersagen einer zukünftigen Haltung einer kopfgetragenen Anzeige (104), HWD, wobei

source: the pose comprises a position and orientation of the HWD relative to a body reference frame of a mobile platform, the system comprising:
de_de: die Haltung eine Position und Ausrichtung des HWD relativ zu einem Körperreferenzrahmen einer mobilen Plattform umfasst, das System umfassend:

source: at least one processor operatively coupled to an HWD worn on a head of a user (102) of the mobile platform, the at least one processor configurable by processor-executable instructions to:
de_de: mindestens einen Prozessor, der mit einem HWD, das ein Benutzer (102) der mobilen Plattform auf dem Kopf trägt, wirkgekoppelt ist, wobei der mindestens eine Prozessor durch prozessorausführbare Anweisungen konfigurierbar ist, um:

source: for each of one or more rotational axes of the HWD:
de_de: für jede der einen oder mehreren Rotationsachsen des HWD:

source: determine, based on a head-frame (110) angular rate of motion of a head reference frame relative to an inertial frame and a body-frame (114) angular rate of motion of the body reference frame relative to the inertial frame, a relative angular rate of motion of the head reference frame relative to the body reference frame;
de_de: basierend auf einer Kopfrahmen (110)-Winkelbewegungsrate eines Kopfreferenzrahmens relativ zu einem Trägheitsrahmen und einer Körperrahmen (114)-Winkelbewegungsrate des Körperreferenzrahmens relativ zu dem Trägheitsrahmen eine relative Winkelbewegungsrate des Kopfreferenzrahmens relativ zu dem Körperreferenzrahmen zu bestimmen;

source: determine, by sampling the relative angular rate, a relative angular acceleration of the head reference frame relative to the body reference frame, the relative angular acceleration associated with a current time;
de_de: durch Abtasten der relativen Winkelrate eine relative Winkelbeschleunigung des Kopfreferenzrahmens relativ zu dem Körperreferenzrahmen zu bestimmen, wobei die relative Winkelbeschleunigung einer aktuellen Zeit zugeordnet ist;

source: determine a projection time relative to the current time, the projected time being a future time associated with at least one of a projected position or a projected orientation of the HWD relative to the body reference frame;
de_de: eine Projektionszeit relativ zu der aktuellen Zeit zu bestimmen, wobei die projizierte Zeit eine zukünftige Zeit ist, die mindestens einer projizierten Position oder einer projizierten Ausrichtung des HWD relativ zu dem Körperreferenzrahmen zugeordnet ist;

source: determine a first angular increment vector component based on the relative angular rate and the projection time;
de_de: eine erste Winkelinkrementvektorkomponente basierend auf der relativen Winkelrate und der Projektionszeit zu bestimmen;

source: determine a second angular increment vector component based on the relative angular acceleration and the projection time;
de_de: eine zweite Winkelinkrementvektorkomponente basierend auf der relativen Winkelbeschleunigung und der Projektionszeit zu bestimmen;

source: determine a total angular increment vector by combining the first and second angular increment vector components;
de_de: einen gesamten Winkelinkrementvektor durch Kombinieren der ersten und zweiten Winkelinkrementvektorkomponente zu bestimmen;

source: receive, from a Kalman filter (208) of the HWD, an estimated pose of the HWD relative to the body reference frame, the estimated pose associated with the current time;
de_de: eine geschätzte Haltung des HWD relativ zu dem Körperreferenzrahmen von einem Kalman-Filter (208) des HWD zu empfangen, wobei die geschätzte Haltung der aktuellen Zeit zugeordnet ist;
